#pragma once
//-----------------------------------------------------------------------------
#include "StdAfx.h"
//-----------------------------------------------------------------------------
namespace MRCrypt
{
    enum class SHAType
    {
        SHA256,
        SHA384,
        SHA512
    };

    //! Кодировать строку в хэш SHA
    //! \param sha_type тип фукнции хэширования
    //! \param s строка, которая будет кодирована
    //! \return возвращает хэш строки. Если вернулась пустая строка - значит ошибка
    std::string StringToSHA(MRCrypt::SHAType sha_type, const std::string& s);
}
//-----------------------------------------------------------------------------
